[
  {
    "id": "1",
    "title": "Hollow Knight",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/367520/header.jpg",
    "category": "Metroidvania",
    "downloadLink": "https://www.teamcherry.com.au/",
    "description": "Hollow Knight is a beautifully hand-drawn action-adventure game that takes players deep into the forgotten world of Hallownest — a kingdom of insects filled with mystery, danger, and ancient secrets. As a small, silent knight, you’ll explore vast interconnected environments, battle fearsome creatures, and uncover haunting lore. The tight combat, atmospheric music, and fluid platforming make it one of the most beloved indie games ever created.",
    "ratings": "4.9",
    "developer": "Team Cherry"
  },
  {
    "id": "2",
    "title": "Celeste",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/504230/header.jpg",
    "category": "Platformer",
    "downloadLink": "https://www.celestegame.com/",
    "description": "Celeste is a precision platformer that tells the story of Madeline, a young woman determined to climb the mysterious Celeste Mountain. Every jump, dash, and fall carries emotional weight as the game weaves a heartfelt narrative about anxiety, self-discovery, and perseverance. With finely tuned controls, beautiful pixel art, and an award-winning soundtrack, Celeste is both a challenge for your reflexes and a balm for your heart.",
    "ratings": "4.8",
    "developer": "Maddy Makes Games"
  },
  {
    "id": "3",
    "title": "Stardew Valley",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/413150/header.jpg",
    "category": "Simulation",
    "downloadLink": "https://www.stardewvalley.net/",
    "description": "In Stardew Valley, you inherit a run-down farm and transform it into a thriving homestead. Plant crops, raise animals, mine for resources, and form meaningful relationships with the townsfolk. Beneath its relaxing pixel art charm lies deep crafting systems, storylines, and surprises waiting in every season. Whether you play for five minutes or fifty hours, Stardew Valley offers endless peace, creativity, and discovery.",
    "ratings": "4.9",
    "developer": "ConcernedApe"
  },
  {
    "id": "4",
    "title": "Undertale",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/391540/header.jpg",
    "category": "RPG",
    "downloadLink": "https://undertale.com/",
    "description": "Undertale is a one-of-a-kind role-playing game where your choices truly matter. You play as a child who falls into an underground world filled with quirky monsters, humor, and heart. You can fight, spare, or befriend everyone you meet — and each decision changes how the story unfolds. With its simple visuals, unforgettable music, and emotional depth, Undertale challenges traditional RPG conventions and celebrates empathy over violence.",
    "ratings": "4.8",
    "developer": "Toby Fox"
  },
  {
    "id": "5",
    "title": "Cuphead",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/268910/header.jpg",
    "category": "Run and Gun",
    "downloadLink": "https://cupheadgame.com/",
    "description": "Cuphead is a love letter to 1930s cartoons, combining hand-drawn animation, jazzy soundtracks, and intense boss battles. You play as Cuphead and Mugman on a chaotic journey to repay their debt to the Devil. Each fight is a vibrant spectacle of timing, memorization, and patience, with art so detailed it feels alive. It’s challenging, rewarding, and one of the most visually striking indie games ever made.",
    "ratings": "4.7",
    "developer": "Studio MDHR"
  },
  {
    "id": "6",
    "title": "Dead Cells",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/588650/header.jpg",
    "category": "Roguelike",
    "downloadLink": "https://dead-cells.com/",
    "description": "Dead Cells blends the best elements of roguelikes and Metroidvanias into one fast-paced experience. You’ll fight through ever-changing castles, discover powerful weapons, and unlock new abilities as you master fluid combat. Each death teaches you something new — and every run feels fresh thanks to smart procedural generation. It’s stylish, tough, and endlessly replayable.",
    "ratings": "4.8",
    "developer": "Motion Twin"
  },
  {
    "id": "7",
    "title": "Hades",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/1145360/header.jpg",
    "category": "Roguelike",
    "downloadLink": "https://www.supergiantgames.com/games/hades/",
    "description": "Hades is a story-driven roguelike where you play as Zagreus, the son of Hades, fighting to escape the Underworld. Each run is packed with fluid combat, witty characters, and evolving narrative moments that deepen over time. With every death, new dialogue, abilities, and lore are unlocked, creating a sense of progression rarely seen in roguelikes. It’s a perfect blend of action, storytelling, and mythological charm.",
    "ratings": "4.9",
    "developer": "Supergiant Games"
  },
  {
    "id": "8",
    "title": "Slay the Spire",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/646570/header.jpg",
    "category": "Card Battler",
    "downloadLink": "https://www.megacrit.com/",
    "description": "Slay the Spire combines deck-building strategy with roguelike progression. Choose a character, craft your deck, and ascend the spire filled with enemies, relics, and decisions. Every card and choice matters, leading to endless replayability. Its elegant design and deep strategy have inspired countless imitators — but none match its balance of tension, planning, and discovery.",
    "ratings": "4.7",
    "developer": "MegaCrit"
  },
  {
    "id": "9",
    "title": "Inside",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/304430/header.jpg",
    "category": "Puzzle Platformer",
    "downloadLink": "https://playdead.com/games/inside/",
    "description": "Inside is a dark and atmospheric puzzle platformer that tells its story without words. You play as a young boy navigating eerie environments filled with strange experiments and haunting imagery. Its minimalist storytelling, emotional depth, and striking visual design make it a masterpiece of environmental narrative. Every moment feels deliberate — and the ending will stay with you long after the credits roll.",
    "ratings": "4.6",
    "developer": "Playdead"
  },
  {
    "id": "10",
    "title": "Limbo",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/48000/header.jpg",
    "category": "Puzzle Platformer",
    "downloadLink": "https://playdead.com/games/limbo/",
    "description": "Limbo is a haunting monochrome adventure that redefined minimalist storytelling in games. You play as a boy searching for his sister through dangerous puzzles and unsettling creatures. Its silent world, clever physics-based design, and haunting atmosphere create an unforgettable emotional experience that paved the way for a generation of indie storytellers.",
    "ratings": "4.5",
    "developer": "Playdead"
  },
  {
    "id": "11",
    "title": "The Witness",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/210970/header.jpg",
    "category": "Puzzle",
    "downloadLink": "https://the-witness.net/",
    "description": "The Witness places you on a mysterious island full of intricate puzzles seamlessly integrated into the environment. Each puzzle teaches you new logic and perspective, rewarding insight rather than brute force. It’s a meditative experience — one that challenges both intellect and observation. With no dialogue or hand-holding, every discovery feels earned and deeply personal.",
    "ratings": "4.4",
    "developer": "Thekla, Inc."
  },
  {
    "id": "12",
    "title": "Ori and the Blind Forest",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/261570/header.jpg",
    "category": "Platformer",
    "downloadLink": "https://www.orithegame.com/blind-forest/",
    "description": "Ori and the Blind Forest tells a powerful story of love, sacrifice, and hope through stunning hand-painted visuals and emotional music. As Ori, a guardian spirit, you traverse a vast forest filled with danger and beauty, unlocking new abilities that let you explore further. It’s a perfect mix of precise platforming, emotional storytelling, and artistic brilliance.",
    "ratings": "4.9",
    "developer": "Moon Studios"
  },
  {
    "id": "13",
    "title": "Oxenfree",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/388880/header.jpg",
    "category": "Adventure",
    "downloadLink": "https://www.nightstudios.com/oxenfree",
    "description": "Oxenfree is a supernatural thriller where a group of friends accidentally open a ghostly rift during a night on an abandoned island. With its natural dialogue system and eerie atmosphere, it builds tension through conversation and mystery rather than combat. Every choice changes the story, leading to multiple endings and a feeling of unease that lingers long after you finish.",
    "ratings": "4.4",
    "developer": "Night School Studio"
  },
  {
    "id": "14",
    "title": "Spiritfarer",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/972660/header.jpg",
    "category": "Simulation",
    "downloadLink": "https://thunderlotusgames.com/spiritfarer/",
    "description": "Spiritfarer is a cozy management game about dying — but it’s really about life, love, and letting go. You play as Stella, a Spiritfarer who helps souls pass on to the afterlife by fulfilling their last wishes. Build, sail, cook, craft, and care for your passengers as you explore a beautiful hand-drawn world. Gentle, emotional, and full of meaning, Spiritfarer turns death into something peaceful and human.",
    "ratings": "4.8",
    "developer": "Thunder Lotus Games"
  },
  {
    "id": "15",
    "title": "Gris",
    "coverPhoto": "https://cdn.cloudflare.steamstatic.com/steam/apps/683320/header.jpg",
    "category": "Platformer",
    "downloadLink": "https://nomada.studio/gris/",
    "description": "Gris is a visually stunning platformer that explores grief, growth, and transformation through art and music. You play as a young girl lost in her own sorrow, navigating dreamlike landscapes that change as she heals emotionally. With no text, enemies, or death, the game tells its story purely through color, animation, and sound. It’s a deeply moving artistic experience that transcends traditional gameplay.",
    "ratings": "4.7",
    "developer": "Nomada Studio"
  }
]
